TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/JourneyPlanner/V1/PlanPublicJourney - Telecabine Journey (Async).xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <PlanPublicJourney xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.JourneyPlanner.V1">
    <transactionId>testJPasync</transactionId>
        <language>en-GB</language>
        <request>
          <IsReturnRequired>false</IsReturnRequired>
          <OutwardArriveBefore>false</OutwardArriveBefore>
          <OutwardDateTime>2014-04-28T11:20:00</OutwardDateTime>
          <InterchangeSpeed>0</InterchangeSpeed>
          <WalkingSpeed>80</WalkingSpeed>
          <MaxWalkingTime>5</MaxWalkingTime>
          <OriginLocation>
            <Type>NaPTAN</Type>
            <NaPTANs>
				<Naptan>
					<NaptanId>9300MIL</NaptanId>
				</Naptan>
			</NaPTANs>
          </OriginLocation>
          <DestinationLocation>
            <Type>NaPTAN</Type>
			<NaPTANs>
				<Naptan>
					<NaptanId>9400ZZDLRVC</NaptanId>
				</Naptan>
			</NaPTANs>
          </DestinationLocation>
          <Sequence>2</Sequence>
        </request>
    </PlanPublicJourney>
  </soap:Body>
</soap:Envelope>